using UnityEngine;

public static class RandomName
{
    public static string GetChinessName()
    {
        string name = "";
        string[] _crabofirstName = new string[]{
            "赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许","何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎","鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨",
            "白","聂","毕","蔡","曹","岑","常","车","陈","成" ,"程","池","邓","丁","范","方","樊","闫","倪","周","冯","符","元","袁","岳","云","曾","詹","张","章","赵","郑" ,"钟","周","邹","朱","庄","卓","傅","甘","高","葛","龚","关","郭","韩","何","贺","洪","侯","胡","华","黄","霍","简","江","姜","蒋","金","康","柯","孔","赖","郎","乐","黎","李","连","廉","梁","林","凌","刘","柳" ,"龙","卢","鲁","陆","路","吕","罗","马" ,"孟","莫","穆","宁","欧","潘","彭","戚","钱","强","秦","丘","邱" ,"任","沈","石","史","苏","孙","谭","汤","唐","陶","田","童","涂","王","韦","魏","温","文","翁","巫","邬","吴","夏","萧","谢","辛","邢","徐","许","薛","严" ,"颜","杨","叶","易","尤","于","余","俞","赵","钱","孙","李","周","吴","郑","王","冯","陈","卫","蒋","沉","韩","杨","朱","秦","尤","许","赵","钱","孙","李","周","吴","郑","王","冯","陈","卫","蒋","沉","韩","杨","朱","秦","尤","许","赵","钱","孙","李","周","吴","郑","王","冯","陈","卫","蒋","韩","杨","朱","秦","许","何","张","孔","曹","严","金","魏","陶","姜","谢","邹","章","云","苏","潘","葛","范","彭","郎","鲁","马","方","俞","任","袁","柳","史","唐","薛","雷","贺","倪","汤","罗","毕","郝","邬","常","于","傅","皮","齐","康","伍","元","卜","顾","孟","平","黄","和","穆","萧","尹","姚","邵","汪","祁","毛","计","伏","成","戴","谈","宋","庞","熊","纪","舒","屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","钟","徐","邱","高","夏","蔡","田","胡","凌","万","卢","干","解","应","宗","丁","宣","邓","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀","羊","于","甄","曲","段","乌","焦","巴","山","车","侯","全","班","仰","仲","伊","宫","甘","符","刘","詹","龙","叶","溥","印","白","卓","乔","谭","申","边","扈","燕","温","庄","晏","柴","瞿","阎","慕","连","习","艾","向","易","衡","匡","巩","冷","曾","关","相","益","桓","岳","楚","闫","佘","佟","福","迟","展","敬"
           };

        string _lastName = "震南洛栩嘉光琛潇闻鹏宇斌威汉火科技梦琪忆柳之召腾飞慕青问兰尔岚元香初夏沛菡傲珊曼文乐菱痴珊恨玉惜香寒新柔语蓉海安夜蓉涵柏水桃醉蓝春语琴从彤傲晴语菱碧彤元霜怜梦紫寒妙彤曼易南莲紫翠雨寒易烟如萱若南寻真晓亦向珊慕灵以蕊寻雁映易雪柳孤岚笑霜海云凝天沛珊寒云冰旋宛儿绿真盼晓霜碧凡夏菡曼香若烟半梦雅绿冰蓝灵槐平安书翠翠风香巧代云梦曼幼翠友巧听寒梦柏醉易访旋亦玉凌萱访卉怀亦笑蓝春翠靖柏夜蕾冰夏梦松书雪乐枫念薇靖雁寻春恨山从寒忆香觅波静曼凡旋以亦念露芷蕾千帅新波代真新蕾雁玉冷卉紫千琴恨天傲芙盼山怀蝶冰山柏翠萱恨松问旋南白易问筠如霜半芹丹珍冰彤亦寒寒雁怜云寻文乐丹翠柔谷山之瑶冰露尔珍谷雪乐萱涵菡海莲傲蕾青槐洛冬易梦惜雪宛海之柔夏青妙菡春竹痴梦紫蓝晓巧幻柏元风冰枫访蕊南春芷蕊凡蕾凡柔安蕾天荷含玉书雅琴书瑶春雁从安夏槐念芹怀萍代曼幻珊谷丝秋翠白晴海露代荷含玉书蕾听访琴灵雁秋春雪青乐瑶含烟涵双平蝶雅蕊傲之灵薇绿春含蕾梦蓉初丹听听蓉语芙夏彤凌瑶忆翠幻灵怜菡紫南依珊妙竹访烟怜蕾映寒友绿冰萍惜霜凌香芷蕾雁卉迎梦元柏代萱紫真千青凌寒紫安寒安怀蕊秋荷涵雁以山凡梅盼曼翠彤谷新巧冷安千萍冰烟雅友绿南松诗云飞风寄灵书芹幼蓉以蓝笑寒忆寒秋烟芷巧水香映之醉波幻莲夜山芷卉向彤小玉幼";
        //3字名字
        name = _crabofirstName[UnityEngine.Random.Range(0, _crabofirstName.Length - 1)] + _lastName[UnityEngine.Random.Range(0, _lastName.Length - 1)] + _lastName[UnityEngine.Random.Range(0, _lastName.Length - 1)];
        //2字名字
        // name = _crabofirstName[UnityEngine.Random.Range(0, _crabofirstName.Length - 1)] +  _lastName[UnityEngine.Random.Range(0, _lastName.Length - 1)];

        return name;
    }
}
